## Plan for org_account/main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 9 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| delete | `module.cloudtrail_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                    |
|        | `module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                              |
|        | `module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0]`                        |
|        | `module.cloudtrail_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                |
|        | `module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`              |
|        | `module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda_s3[0]`        |
|        | `module.cloudtrail_forwarder.aws_lambda_function.sentinel_forwarder`                                |
|        | `module.cloudtrail_forwarder.aws_lambda_permission.sentinel_forwarder_s3_triggers[0]`               |
|        | `module.cloudtrail_forwarder.aws_s3_bucket_notification.sentinel_forwarder_trigger_notification[0]` |
| add    | `aws_iam_role.azure_sentinel`                                                                       |
|        | `aws_s3_bucket_notification.azure_cloudtrail_bucket_notification`                                   |
|        | `aws_sqs_queue.cloudtrail_sqs_queue`                                                                |
|        | `aws_sqs_queue_policy.sqs_queue_policy`                                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.azure_sentinel will be created
  + resource "aws_iam_role" "azure_sentinel" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + sts:ExternalId = "90ad7e41-b287-4d79-8c21-01f328f577b9"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::197857026523:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Azure Sentinel Integration"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess",
          + "arn:aws:iam::aws:policy/AmazonSQSReadOnlyAccess",
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaSQSQueueExecutionRole",
        ]
      + max_session_duration  = 3600
      + name                  = "AzureSentinelRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_s3_bucket_notification.azure_cloudtrail_bucket_notification will be created
  + resource "aws_s3_bucket_notification" "azure_cloudtrail_bucket_notification" {
      + bucket      = "aws-controltower-logs-274536870005-ca-central-1"
      + eventbridge = false
      + id          = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "o-gfiiyvq1tj/AWSLogs/"
          + id            = "azure-sentinel-cloudtrail-queue-log-event"
          + queue_arn     = (known after apply)
        }
    }

  # aws_sqs_queue.cloudtrail_sqs_queue will be created
  + resource "aws_sqs_queue" "cloudtrail_sqs_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ca-central-1:274536870005:key/72713e0c-b7f4-438a-9eca-41c36b775f30"
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "azure-sentinel-cloudtrail-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.sqs_queue_policy will be created
  + resource "aws_sqs_queue_policy" "sqs_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.cloudtrail_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be destroyed
  # (because aws_cloudwatch_log_group.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-cloud-trail-forwarder" -> null
      - id                = "/aws/lambda/sentinel-cloud-trail-forwarder" -> null
      - name              = "/aws/lambda/sentinel-cloud-trail-forwarder" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "cds-aws-lz-production"
        } -> null
      - tags_all          = {
          - "CostCentre" = "cds-aws-lz-production"
        } -> null
    }

  # module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_policy.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      - arn       = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - name      = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-cloud-trail-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAT725MGB276XVOQJTE" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0] will be destroyed
  # (because aws_iam_policy.sentinel_forwarder_lambda_s3 is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda_s3" {
      - arn       = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder" -> null
      - id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder" -> null
      - name      = "SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::aws-controltower-logs-274536870005-ca-central-1"
                      - Sid      = "1"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::aws-controltower-logs-274536870005-ca-central-1/*"
                      - Sid      = "2"
                    },
                  - {
                      - Action   = "kms:decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:274536870005:key/72713e0c-b7f4-438a-9eca-41c36b775f30"
                      - Sid      = "3"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAT725MGB2XVDEBYQ2F" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.cloudtrail_forwarder.aws_iam_role.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_role.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_role" "sentinel_forwarder_lambda" {
      - arn                   = "arn:aws:iam::274536870005:role/SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-06-14T17:12:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-cloud-trail-forwarder",
          - "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAT725MGB25N3ZEXBAY" -> null

      - inline_policy {}
    }

  # module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be destroyed
  # (because aws_iam_role_policy_attachment.sentinel_forwarder_lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      - id         = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder-20220614171214163700000002" -> null
      - policy_arn = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
    }

  # module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda_s3[0] will be destroyed
  # (because aws_iam_role_policy_attachment.sentinel_forwarder_lambda_s3 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda_s3" {
      - id         = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder-20220614171214158100000001" -> null
      - policy_arn = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
    }

  # module.cloudtrail_forwarder.aws_lambda_function.sentinel_forwarder will be destroyed
  # (because aws_lambda_function.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_function" "sentinel_forwarder" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:274536870005:function:sentinel-cloud-trail-forwarder" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to forward AWS logs to Azure Sentinel" -> null
      - filename                       = "/tmp/sentinel_forwarder.py.zip" -> null
      - function_name                  = "sentinel-cloud-trail-forwarder" -> null
      - handler                        = "sentinel_forwarder.lambda_handler" -> null
      - id                             = "sentinel-cloud-trail-forwarder" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:274536870005:function:sentinel-cloud-trail-forwarder/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-10-07T16:01:41.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:9",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:274536870005:function:sentinel-cloud-trail-forwarder:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:274536870005:function:sentinel-cloud-trail-forwarder:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::274536870005:role/SentinelForwarderLambda-sentinel-cloud-trail-forwarder" -> null
      - runtime                        = "python3.9" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> null
      - source_code_size               = 300 -> null
      - tags                           = {
          - "CostCentre" = "cds-aws-lz-production"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "cds-aws-lz-production"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CUSTOMER_ID" = (sensitive)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "Active" -> null
        }
    }

  # module.cloudtrail_forwarder.aws_lambda_permission.sentinel_forwarder_s3_triggers[0] will be destroyed
  # (because aws_lambda_permission.sentinel_forwarder_s3_triggers is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_s3_triggers" {
      - action         = "lambda:InvokeFunction" -> null
      - function_name  = "sentinel-cloud-trail-forwarder" -> null
      - id             = "AllowExecutionFromS3-sentinel-cloud-trail-forwarder-0" -> null
      - principal      = "s3.amazonaws.com" -> null
      - source_account = "274536870005" -> null
      - source_arn     = "arn:aws:s3:::aws-controltower-logs-274536870005-ca-central-1" -> null
      - statement_id   = "AllowExecutionFromS3-sentinel-cloud-trail-forwarder-0" -> null
    }

  # module.cloudtrail_forwarder.aws_s3_bucket_notification.sentinel_forwarder_trigger_notification[0] will be destroyed
  # (because aws_s3_bucket_notification.sentinel_forwarder_trigger_notification is not in configuration)
  - resource "aws_s3_bucket_notification" "sentinel_forwarder_trigger_notification" {
      - bucket      = "aws-controltower-logs-274536870005-ca-central-1" -> null
      - eventbridge = false -> null
      - id          = "aws-controltower-logs-274536870005-ca-central-1" -> null

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - filter_prefix       = "o-625no8z3dd/AWSLogs/o-625no8z3dd/" -> null
          - id                  = "tf-s3-lambda-20220909161015354800000001" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:274536870005:function:sentinel-cloud-trail-forwarder" -> null
        }
    }

Plan: 4 to add, 0 to change, 9 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.azure_sentinel"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.cloudtrail_sqs_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
